# Практическая часть

In [101]:
df = pd.DataFrame({'id': [1, 2, 3, 4, 5],
      'created_at': ['2020-02-01', '2020-02-02', '2020-02-02', '2020-02-02', '2020-02-03'],
      'type': ['red', np.NaN, 'blue', 'blue', 'yellow']})
df.head()

   id  created_at    type
0   1  2020-02-01     red
1   2  2020-02-02     NaN
2   3  2020-02-02    blue
3   4  2020-02-02    blue
4   5  2020-02-03  yellow


### 1) В переменной df находится датафрэйм. Запишите в переменную  df_shape строку с информацией о том, сколько строк и столбцов он содержит, в следующем виде:

'df has y rows and x columns'

где y — число строк, а x — число колонок.

In [102]:
# ваш код
df_shape = 'df has {} rows and {} columns'.format(df.shape[0],df.shape[1])
df_shape

'df has 5 rows and 3 columns'

### 2) Сохраните в переменную na_number серию, в которой для каждой колонки будет указано, сколько пропущенных значений она содержит:
(Используйте функцию sum())

In [98]:

nan_df = pd.DataFrame({'id': [8, 9],
      'created_at': ['2020-04-01', '2020-043-02'],
      'type': ['white', np.nan]})
nan_df

   id   created_at   type
0   8   2020-04-01  white
1   9  2020-043-02    NaN

In [99]:
# ваш код
na_number = nan_df.isnull().sum()
na_number

id            0
created_at    0
type          1
dtype: int64

### 3) Сохраните в переменную df_types типы данных каждой колонки датафрэйма df

In [97]:
# ваш код
df_types = df.dtypes
df_types

id             int64
created_at    object
age           object
dtype: object

### 4) Внезапно оказалось, что в колонке age значения хранятся в виде строк! Поменяйте тип значений на целочисленный в этой колонке датафрэйма df без изменения текущего dataframe

In [95]:
df = pd.DataFrame({'id': [8, 9,19],
      'created_at': ['2020-04-01', '2020-03-02' ,'2020-03-02'],
      'age': ['12', '13','15']})

In [96]:
# ваш код
df.age.astype('int')

0    12
1    13
2    15
Name: age, dtype: int64

### 5) Как выяснилось, для дальнейшего анализа нам не понадобятся колонки id и type – удалите их из датафрэйма.

In [92]:

df = pd.DataFrame({'id': [8, 9],
      'created_at': ['2020-04-01', '2020-04-02'],
      'type': ['white', np.nan]})
df

   id  created_at   type
0   8  2020-04-01  white
1   9  2020-04-02    NaN

In [93]:
# ваш код
df.drop(columns = ['id','type'])

   created_at
0  2020-04-01
1  2020-04-02

### 6) А теперь проверим, есть ли в нашей таблице df дубликаты по полю created_at. Сохраните в переменную df датафрейм, в котором не будет дубликатов по колонке created_at, оставив первую строку с id

In [ ]:
df = pd.DataFrame({'id': [1, 2, 3, 4, 5],
      'created_at': ['2020-02-01', '2020-02-02', '2020-02-02', '2020-02-02', '2020-02-03'],
      'type': ['red', np.NaN, 'blue', 'blue', 'yellow']})
df.head()

In [ ]:
# ваш код
df = df.drop_duplicates(subset = ['created_at'])

### 7) А сейчас ненадолго вернемся к чистому Python.

В списке numbers содержатся числа. Добавьте через цикл в список positive_numbers положительные числа из numbers. Если вам попался 0, то нужно прекратить этот цикл.

Например,

numbers = [1, -2, 3, 0, -3, 2]

Тогда positive_numbers должен быть:

positive_numbers = [1, 3]

In [89]:
numbers = [1, -2, 3, 0, -3, 2]

In [90]:
positive_numbers = []
for i in numbers:
    if i>0:
        positive_numbers.append(i)
    elif i==0:
        break
positive_numbers

[1, 3]

In [ ]:
# ваш код
positive_numbers = [i for i in numbers if i>0]
positive_numbers

# 8) Теперь посмотрим на колонки со временем!

Датасет находится в 3_taxi_peru.csv. Сохраните данные в переменную taxi, разделитель — ;.

Затем приведите столбцы start_at, end_at, arrived_at к формату даты, используя pd.to_datetime(). Отфильтруйте данные и оставьте наблюдения со статусом заказа (start_type) "asap" и "reserved" (start_type) .

In [53]:
#приведите столбцы start_at, end_at, arrived_at к формату даты

df = pd.read_csv('/Users/kamilamur/Downloads/5/3_taxi_peru.csv', sep = ';',parse_dates = ['start_at', 'end_at','arrived_at'])
df.dtypes

journey_id                  object
user_id                     object
driver_id                   object
taxi_id                     object
icon                        object
start_type                  object
start_at            datetime64[ns]
start_lat                   object
start_lon                   object
end_at              datetime64[ns]
end_lat                     object
end_lon                     object
end_state                   object
driver_start_lat            object
driver_start_lon            object
arrived_at          datetime64[ns]
source                      object
driver_score               float64
rider_score                float64
dtype: object

In [56]:
#Отфильтруйте данные и оставьте наблюдения со статусом заказа (start_type) "asap" и "reserved" (start_type) .

df.query("start_type in ['asap','reserved']").head(2)

,journey_id,user_id,driver_id,taxi_id,icon,start_type,start_at,start_lat,start_lon,end_at,end_lat,end_lon,end_state,driver_start_lat,driver_start_lon,arrived_at,source,driver_score,rider_score
0,23a1406fc6a11d866e3c82f22eed4d4c,0e9af5bbf1edfe591b54ecdfd7e91e26,583949a89a9ee17d19e3ca4f137b6b4c,b12f4f09c783e29fe0d0ea624530db56,executive,asap,2010-11-16 16:44:00,"-12,13983536","-77,02355957",2010-11-16 17:29:00,"-12,05537033","-77,0413208",drop off,"-12,10825481","-77,0272739",2010-11-16 17:02:00,iPhone,5.0,5.0
1,dd2af4715d0dc16eded53afc0e243577,a553c46e3a22fb9c326aeb3d72b3334e,NaN,NaN,executive,asap,2010-06-01 00:34:00,"-12,13874817","-76,99536133",2010-06-01 00:37:00,"-12,12465668","-77,02886963",not found,NaN,NaN,NaT,iPhone,NaN,NaN

### 9)⭐️Задание со звёздочкой!⭐️

Создайте колонку wait_time, в которой будет храниться разница между временем подачи машины (arrived_at) и временем заказа (start_at) в минутах.

Чтобы сконвертировать полученный результат в минуты, можно использовать метод  .astype('timedelta64[m]').

Используйте данные из шага 8

In [78]:
# разница между временем подачи машины (arrived_at) и временем заказа (start_at) в минутах

df['wait_time'] = (df['arrived_at'] - df['start_at']).astype('timedelta64[m]')

df['wait_time']

0        18.0
1         NaN
2         NaN
3         NaN
4        -5.0
         ...
23106     0.0
23107    13.0
23108     9.0
23109    -7.0
23110     NaN
Name: wait_time, Length: 23111, dtype: float64

### 10)⭐️Задание со звёздочкой!⭐️

Добавьте столбец month, где будет храниться номер месяца, в котором был сделан заказ (start_at),  и столбец weekday – название дня недели. 

как извлечь нужное значение из даты?
.dt.strftime('%A') – извлечь день недели в формате названия
Данные загружены в taxi и отфильтрованы, как в 8 шаге.

In [84]:
#столбец с номером месяца

df['month'] = df.start_at.dt.month
df.head(1)

,journey_id,user_id,driver_id,taxi_id,icon,start_type,start_at,start_lat,start_lon,end_at,...,end_lon,end_state,driver_start_lat,driver_start_lon,arrived_at,source,driver_score,rider_score,wait_time,month
0,23a1406fc6a11d866e3c82f22eed4d4c,0e9af5bbf1edfe591b54ecdfd7e91e26,583949a89a9ee17d19e3ca4f137b6b4c,b12f4f09c783e29fe0d0ea624530db56,executive,asap,2010-11-16 16:44:00,"-12,13983536","-77,02355957",2010-11-16 17:29:00,...,"-77,0413208",drop off,"-12,10825481","-77,0272739",2010-11-16 17:02:00,iPhone,5.0,5.0,18.0,11

In [87]:
#столбец с названием дня недели 

df['weekday'] = df.start_at.dt.strftime('%A')
df.head(3)

,journey_id,user_id,driver_id,taxi_id,icon,start_type,start_at,start_lat,start_lon,end_at,...,end_state,driver_start_lat,driver_start_lon,arrived_at,source,driver_score,rider_score,wait_time,month,weekday
0,23a1406fc6a11d866e3c82f22eed4d4c,0e9af5bbf1edfe591b54ecdfd7e91e26,583949a89a9ee17d19e3ca4f137b6b4c,b12f4f09c783e29fe0d0ea624530db56,executive,asap,2010-11-16 16:44:00,"-12,13983536","-77,02355957",2010-11-16 17:29:00,...,drop off,"-12,10825481","-77,0272739",2010-11-16 17:02:00,iPhone,5.0,5.0,18.0,11,Tuesday
1,dd2af4715d0dc16eded53afc0e243577,a553c46e3a22fb9c326aeb3d72b3334e,NaN,NaN,executive,asap,2010-06-01 00:34:00,"-12,13874817","-76,99536133",2010-06-01 00:37:00,...,not found,NaN,NaN,NaT,iPhone,NaN,NaN,NaN,6,Tuesday
2,dd91e131888064bf7df3ce08f3d4b4ad,a553c46e3a22fb9c326aeb3d72b3334e,NaN,NaN,executive,asap,2010-05-31 05:01:00,"-12,12453079","-77,02780151",2010-05-31 05:04:00,...,not found,NaN,NaN,NaT,iPhone,NaN,NaN,NaN,5,Monday